In [1]:
import numpy as np
import pandas as pd

In [4]:
df=pd.read_excel('sample.xlsx', parse_dates=['Date'], index_col='Date')
df

                A      B      C      D      E
Date
2013-07-08  0.015  0.082  0.096  0.020  0.075
2013-07-09  0.037  0.095  0.027  0.063  0.024

Note: You may have to use Panda's DataFrame.iterrows with Series.nlargest in order to implement the function. This is one of those cases where creating a vecorization solution is too difficult.

In [9]:
idx=next(df.iterrows())[0]
idx

Timestamp('2013-07-08 00:00:00')

In [5]:
row = next(df.iterrows())[1]
row

A    0.015
B    0.082
C    0.096
D    0.020
E    0.075
Name: 2013-07-08 00:00:00, dtype: float64

In [6]:
row.nlargest(3)

C    0.096
B    0.082
E    0.075
Name: 2013-07-08 00:00:00, dtype: float64

In [14]:
for idx, row in df.iterrows():
    print(idx)
    print('\n')
    print(row)
    print('\n')
    
    print(row.nlargest(3).index)
    print('\n')

2013-07-08 00:00:00


A    0.015
B    0.082
C    0.096
D    0.020
E    0.075
Name: 2013-07-08 00:00:00, dtype: float64


Index(['C', 'B', 'E'], dtype='object')


2013-07-09 00:00:00


A    0.037
B    0.095
C    0.027
D    0.063
E    0.024
Name: 2013-07-09 00:00:00, dtype: float64


Index(['B', 'D', 'A'], dtype='object')

In [20]:
df1=df.apply(lambda x: x.nlargest(3), axis=1)
df1

                A      B      C      D      E
Date
2013-07-08    NaN  0.082  0.096    NaN  0.075
2013-07-09  0.037  0.095    NaN  0.063    NaN

In [23]:
df1.notnull().astype(int)

            A  B  C  D  E
Date
2013-07-08  0  1  1  0  1
2013-07-09  1  1  0  1  0

In [24]:
df.apply(lambda x: x.nlargest(3), axis=1).notnull().astype(int)

            A  B  C  D  E
Date
2013-07-08  0  1  1  0  1
2013-07-09  1  1  0  1  0

In [25]:
def get_top_n(prev_returns, top_n):
    """
    Select the top performing stocks
    
    Parameters
    ----------
    prev_returns : DataFrame
        Previous shifted returns for each ticker and date
    top_n : int
        The number of top performing stocks to get
    
    Returns
    -------
    top_stocks : DataFrame
        Top stocks for each ticker and date marked with a 1
    """
    # TODO: Implement Function
        
    
    return prev_returns.apply(lambda x: x.nlargest(top_n), axis=1).notnull().astype(int)

In [26]:
get_top_n(df, 3)

            A  B  C  D  E
Date
2013-07-08  0  1  1  0  1
2013-07-09  1  1  0  1  0